.tsung/createTag.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="50000"/>
    </clients>

    <servers>
        <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
    </servers>

    <load>
      <arrivalphase phase="1" duration="30" unit="second">
        <users arrivalrate="16" unit="second"/>
      </arrivalphase>
      <arrivalphase phase="2" duration="30" unit="second">
        <users arrivalrate="32" unit="second"/>
      </arrivalphase>
      <arrivalphase phase="3" duration="30" unit="second">
        <users arrivalrate="64" unit="second"/>
      </arrivalphase>
      <arrivalphase phase="4" duration="30" unit="second">
        <users arrivalrate="128" unit="second"/>
      </arrivalphase>
      <arrivalphase phase="5" duration="30" unit="second">
        <users arrivalrate="256" unit="second"/>
      </arrivalphase>
    </load>

    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <setdynvars sourcetype="random_number" start="1" end="20">
              <var name="randuserid"/>
            </setdynvars>
            <transaction name="LOG_IN">
              <request>
                <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"/>
                <http url="/" method="GET" version="1.1"/>
              </request>
              <request> <http url="/login" method="GET" version="1.1"/> </request>
              <thinktime value="3" random="true"/>
              <request subst="true">
                <dyn_variable name="loginstatus" re="(.*)"/>
                <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r"/>
                <http url="/login" contents="authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_randuserid%%user@hotmail.com&amp;session[password]=test" method="POST" version="1.1">
                </http>
              </request>
            </transaction>

            <transaction name="CREATE_TAG">
                <request>
                    <http url="/tags/new" method="GET" version="1.1"/>
                </request>

                <setdynvars sourcetype="random_string" length="10">
                    <var name="name"/>
                </setdynvars>
                <setdynvars sourcetype="random_string" length="30">
                    <var name="description"/>
                </setdynvars>

                <request subst="true">
                    <dyn_variable name="createtagstatus" re="(.*)"/>
                    <http url="/tags" contents="authenticity_token=%%_authenticity_token%%&amp;name=%%_name%%&amp;description=%%_description%%" method="POST" version="1.1">
                    </http>
                </request>
            </transaction>

            <transaction name="VIEW_Profile">
                <request subst="true">
                    <http url="/users/%%_userid%%" method="GET" version="1.1"/>
                </request>
            </transaction>

            <transaction name="VIEW_TAG">
                <request subst="true">
                    <http url="/" method="GET" version="1.1"/>
                </request>
            </transaction>

            <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
            io:format([126, $p, 126, $n, 126, $n], [DynVars]),
            ok end.">
            </setdynvars>
        </session>
    </sessions>
</tsung>