.tsung/newPostPoints.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="18000"/>
  </clients>
<!--
  <servers>
    <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers> -->

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="3" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="2" duration="3" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="3" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase> -->
  </load>
  <options>
    <option name="file_server" id="userlist" value="/Users/zephyrz/291a/fp/PANDA/.tsung/user.csv" />
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <transaction name="LOG_IN">
        <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
          <var name="name" />
          <var name="password" />
          <var name="email" />
          <var name="points" />
        </setdynvars>
        <request>
          <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"></dyn_variable>
          <http url="/" method="GET" version="1.1"></http>
        </request>
        <!-- user click on login button to fill in form -->
        <request> <http url="/login" method="GET" version="1.1"></http> </request>
        <!-- user is filling login form -->
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="loginstatus" re="(.*)"/>
          <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r" />
          <http
            url="/login"
            contents='authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test'
            method="POST"
            version="1.1">
          </http>
        </request>
      </transaction>

      <transaction name="CREATE_POST">
        <!-- see which tag interesting to post-->
        <request>
          <http url="/tags" method="GET" version="1.1" />
        </request>

        <!-- go to the make new post page -->
        <request>
          <http url="/posts/new" method="GET" version="1.1" />
        </request>

        <!-- user is writing a post, it takes time -->
        <!-- <thinktime value="20" random="true"></thinktime> -->

        <!-- submitting the post -->
        <setdynvars sourcetype="random_number" start="1" end="10">
          <var name="randtagid"/>
        </setdynvars>
        <setdynvars sourcetype="random_number" start="0" end="100">
          <var name="randreadpoints"/>
        </setdynvars>
        <setdynvars sourcetype="random_string" length="50">
          <var name="postbody"/>
        </setdynvars>
        <setdynvars sourcetype="random_string" length="20">
          <var name="posttitle"/>
        </setdynvars>
        <request subst="true">
          <dyn_variable name="poststatus" re="(.*)"/>
          <http
            url="/posts"
            contents='authenticity_token=%%_authenticity_token%%&amp;post[points2view]=%%_randreadpoints%%&amp;post[title]=%%_posttitle%%&amp;post[body]=%%_postbody%%&amp;post[tag_id]=%%_randtagid%%&amp;post[user_id]=%%_userid%%'
            method="POST"
            version="1.1">
          </http>
        </request>
      </transaction>

      <transaction name="VIEW_PROFILE">
        <request subst="true">
          <dyn_variable name="profilestatus" re="(.*)"/>
          <http url="/users/%%_userid%%" method="GET" version="1.1" />
        </request>
      </transaction>

      <!-- <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
      io:format([126, $p, 126, $n, 126, $n], [DynVars]),
      ok end.">
      </setdynvars> -->
    </session>
  </sessions>
</tsung>